#ifndef __BSP_CAN_H
#define __BSP_CAN_H
/***********************************************************************************************************************************
 ** 【代码编写】  魔女开发板团队
 ** 【淘    宝】  魔女开发板       https://demoboard.taobao.com
 ***********************************************************************************************************************************
 ** 【文件名称】  bsp_CAN.h
 **
 ** 【 功  能 】  CAN通信
 **
 ** 【适用平台】  STM32F407 + keil5 + CubeMX配置 + HAL库
 **
 ** 【 CubeMX 】  1- 使用CubeMX开启CAN1;
 **               2- 在CAN1的参数页面，配置波特率;
 **               3- 在CAN1的中断页面，打勾中断：CAN1 RX0 interrupts
 **               4- CAN1开启后，默认引脚为PA11+PA12, 需要核对原理图的引脚使用，如果原理图上使用的是PB8+PB9，则需要进行修改。
 **
 ** 【bsp_CAN】   CubeMX配置CAN1并重新生成后，会生成can.c和can.h，并在main.c中调用了MX_CAN1_Init(), 对其所用引脚、CAN配置，都进行了初始化。
 **               用户需要在CubeMX生成的代码基础上，编写发送、接收、筛选器配置的处理代码。
 **               我们把上述CAN通信的自定义代码，写在了自行新建的bsp_CAN.h和bsp_CAN.c文件中; 这样处理，好处有二：
 **               1- 使代码更直观: 底层配置代码原封不动在can.c和h中, 而应用代码则在bsp_CAN.c和h里;
 **               2- 如果后续的工程，CubeMX没有使能CAN，重新生成后会删掉can.c和h文件，如果把自定义通信代码写在其中，也会随文件被删除，不利于代码日后再次使用;
 **
 ** 【移植说明】  1- 复制本工程的CAN文件夹，到目标工程文件夹中;
 **               2- 添加头文件路径： Keil > Option > C/C++ > Include Paths;
 **               3- 添加C文件到工程: Keil > 左侧工程管理器中双击目标文件夹 > 选择 bsp_CAN.c;
 **               4- 添加文件引用:    #include "bsp_CAN.h＂，即哪个文件要用串口功能，就在其代码文件顶部添加引用;
 **
 ** 【代码使用】  1- 初始化的代码: CubeMX已生成好了，我们无需修改、增删;
 **               2- 筛选器的配置: 在bsp_CAN.c中，已写了一个示例函数，调用即可：接收所有数据帧，包括标准帧和扩展帧; 函数里，在配置筛选器后开启CAN1, 开始工作
 **               3- 需要代码开启CAN1，即调用HAL函数 HAL_CAN_Start(&hcan1) ，本函数已在上述自定义的筛选器函数中调用;
 **               4- 发送，已写好一个自定义的发送函数，在函数中配置报文格式，需要发送时数据，调用函数传入数据即可, 可按需修改;
 **               5- 接收，已写好自定义的中断接收回调函数，在bsp_CAN.c中。在接收到新帧后，数据自动转存，外部只需调用CAN1_GetRxNum()判断返回值>0，即表示已接收到新数据，使用方法详见main.c中使用示范。
 **
 ** 【划 重 点】  CAN1有两组引脚：使能CAN1后，默认启用PA11+PA12; 另一组引脚是PB8+PB9, 注意不要选错了;
 **               CubeMX在配置后，只是生成了引脚初始化、CAN初始化，并不会帮我们生成发送、接收、筛选器配置的相关函数，需要我们手写。
 **               很多教程会大幅篇章地介绍CAN时序和波特率的计算，但是，建议新手不用太在意。特别是波特率的计算，直接上csdn搜文章抄参数即可，或者用专门的软件进行计算(示例文件夹里已附有）。来来去去就那几个常用波特率，没必要费时间。
 **               关于发送，同上，很多教程会讲解发送邮箱的使用。新手真没必要费时间，先完成再完善，在自定义发送函数中配置好帧格式，然后直接调用HAL的发送函数好，它会帮你处理好。
 **               关于接收，同上，很多教程会花大量的时间讲解两组三级深度FIFO的原理。HAL库都帮我们处理好了，只管在自定义的筛选器配置函数中，决定用哪个FIFO, 收到数据后迅速处理即可。
 **               筛选器的配置，才是CAN通信学习时的重中之重，灵活使用，能减少中断资源的浪费。筛选器比较难理解，三言两语真心说不清，建议多刨csdn文章，很有必要透彻地理解！
 **               另外, 还需要重点学习的，是：错误帧、自动离线处理、离线唤醒等，当你项目中需要深度使用CAN时，就需要细刨芯片CAN的寄存器描述，才能深入开发。
 **
 ** 【主要更新】  2026-02-01  发送函数CAN1_SendData()修复超时bug; 筛选器配置函数CAN1_FilterInit()增加列表模式、完善注释;
 **               2025-02-28  接收数据的获取：取消全局变量，改为调用函数返回;
 **               2024-01-30  建立文件
 **
************************************************************************************************************************************/

#include "main.h"        // CubeMX生成，包含全局宏定义、外设初始化声明、全局类型定义
#include "can.h"         // CubeMX生成，CAN外设底层驱动依赖
                         
#include "stdio.h"       // 标准C库的输入输出头文件; 标准输入输出函数，如printf、scanf、文件操作函数(在嵌入式系统中常用于串口重定向)
#include "string.h"      // 标准C库的字符串处理头文件; 字符串操作函数, 如strcpy、strlen、memcpy、memset等,常用于数据拷贝、比较和初始化操作

#include "bsp_UART.h"    // 用户移植的UART通信文件，支持printf





/*****************************************************************************
 ** 函数声明  (CAN1通信核心接口)
****************************************************************************/
// 发送
uint8_t CAN1_SendData(uint32_t type, uint32_t ID, uint8_t *msgData, uint8_t num);  // 数据发送：帧格式、帧ID、数据地址、字节数
// 筛选器配置
void    CAN1_FilterInit(void);                                                     // CAN1筛选器配置、使能CAN1接收中断
// 接收
uint8_t  CAN1_GetRxNum(void);                                                      // 获取最后一帧接收的字节数（0=无新数据）
uint8_t *CAN1_GetRxData(void);                                                     // 获取最后一帧接收的数据缓冲区地址
void     CAN1_ClearRx(void);                                                       // 清除接收标志（重置接收字节数为0）
CAN_RxHeaderTypeDef CAN1_GetRxHeader(void);                                        // 获取最后一帧接收的报文头部信息


#endif

// 文件结尾，需要保留至少1空行

